app/views/orders/_form.html.erb

    <div id="error_explanation">
      <h2><%= t('errors.template.header', :count=>@order.errors.size,
        :model=>t('activerecord.models.order')) %>.</h2>
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 18 LIMIT 1