app/controllers/admin_controller.rb

SELECT COUNT(*) FROM `orders`
---
  def index
  	  @cart = current_cart
  	  @total_orders = Order.count