app/controllers/carts_controller.rb

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1
---
  def show
  	  begin
  	   @cart = Cart.find(params[:id])

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1
---
  def edit
    @cart = Cart.find(params[:id])

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1
---
  def update
    @cart = Cart.find(params[:id])

DELETE FROM `carts` WHERE `carts`.`id` = 1
---
  def destroy
    @cart = current_cart
    @cart.destroy