app/controllers/line_items_controller.rb

  def index
    @line_items = LineItem.all
---
SELECT `line_items`.* FROM `line_items`

  def show
    @line_item = LineItem.find(params[:id])
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 1 LIMIT 1

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

   session[:counter] = 0
    respond_to do |format|
      if @line_item.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 ORDER BY title LIMIT 1
INSERT INTO `carts` (`updated_at`, `created_at`) VALUES ('2011-03-22 07:25:21', '2011-03-22 07:25:21')
INSERT INTO `line_items` (`cart_id`, `order_id`, `quantity`, `shipping_date`, `product_id`, `created_at`, `updated_at`) VALUES (63, NULL, 1, NULL, 2, '2011-03-25 08:04:13', '2011-03-25 08:04:13')
UPDATE `line_items` SET `updated_at` = '2011-03-22 13:37:17', `quantity` = 2 WHERE `line_items`.`id` = 17

  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 25 LIMIT 1
DELETE FROM `line_items` WHERE `line_items`.`id` = 25