app/controllers/orders_controller.rb

SELECT COUNT(*) FROM `orders`
SELECT `orders`.* FROM `orders` ORDER BY created_at desc LIMIT 10 OFFSET 0
---
  def index
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',
              :per_page => 10

SELECT COUNT(*) FROM `line_items` WHERE (`line_items`.cart_id = 40)
SELECT `line_items`.* FROM `line_items` WHERE (`line_items`.cart_id = 40)
---
  def new
  	 @cart = current_cart
            if @cart.line_items.empty?

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 18 LIMIT 1
---
  def edit
    @cart = current_cart
    @order = Order.find(params[:id])

INSERT INTO `carts` (`updated_at`, `created_at`) VALUES ('2011-03-30 05:26:06', '2011-03-30 05:26:06')
INSERT INTO `orders` (`email`, `pay_type`, `updated_at`, `created_at`, `address`, `name`) VALUES ('sashe@mail.rb.ru', 'Кредитка', '2011-03-24 11:43:28', '2011-03-24 11:43:28', 'qqqqqqqqqqqqqqqqqqqqqqqq', 'qqqqqqqqqqq')
DELETE FROM `carts` WHERE `carts`.`id` = 44
SELECT `line_items`.* FROM `line_items` WHERE (`line_items`.order_id = 13)
---
  def create
  	  @cart = current_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)
    respond_to do |format|
      if @order.save
      	Cart.destroy(session[:cart_id])
      	session[:cart_id] = nil
      	Notifier.order_received(@order).deliver

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 21 LIMIT 1
---
  def update
  	@cart = current_cart
    @order = Order.find(params[:id])