app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY title
---
  def index
    @products = Product.all

SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 ORDER BY title LIMIT 1
---
  def show
    @product = Product.find(params[:id])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 ORDER BY title LIMIT 1
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO `products` (`description`, `title`, `image_url`, `updated_at`, `created_at`, `price`) VALUES ('Очень клёвая и удобная книга про самый крутой язык', 'Книжка про руби', '', '2011-03-18 08:13:11', '2011-03-18 08:13:11', 54.0)
---
  def create
    @product = Product.new(params[:product])
    @cart = current_cart
    respond_to do |format|
      if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 ORDER BY title LIMIT 1
UPDATE `products` SET `updated_at` = '2011-03-17 09:11:58', `description` = 'Классная!!!\r\nerror saying Address already in use when you try to run the server, that simply\r\nmeans you already have a Rails server running on your machine. If you’ve been\r\nfollowing along with the examples in the book, that might well be the “Hello,\r\nWorld!” application from Chapter 4. Find its console, and kill the server using\r\nCtrl-C. If you are running on Windows, you may see the prompt Terminate batch\r\njob (Y/N)?. If so, respond with y.\r\nLet’s connect to it. Remember, the URL we' WHERE `products`.`id` = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 ORDER BY title LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 4
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy