app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY name
---
  def index
  	  @users = User.order(:name)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
  	  @cart = current_cart
    @user = User.find(params[:id])

INSERT INTO `users` (`updated_at`, `salt`, `hashed_password`, `created_at`, `name`) VALUES ('2011-03-28 09:29:42', '274134360.0644073998037185', '21e53876f8567489228cdbea062077c4a0a97adde395165b00ea87eef09a21dc', '2011-03-28 09:29:42', 'Sashe')
---
  def create
    @user = User.new(params[:user])
    @cart = current_cart
    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy